In [1]:
#import numpy and pandas
import numpy as np 
import pandas as pd

In [2]:
#import data set
titanic = pd.read_csv('train.csv')
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
#Confirming each PassengerId is unique in case there are double counts for things such as groupings of families
titanic['PassengerId'].is_unique

True

In [5]:
titanic['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [6]:
# survival rate of the titanic
titanic_survival_rate = (titanic[titanic['Survived']==1]['Survived'].sum())/(titanic['Survived'].count())
titanic_survival_rate_percentage = "{:.2%}".format(titanic_survival_rate)
titanic_survival_rate_percentage

'38.38%'

In [7]:
#What is the survival rate between male and female
data = titanic[['Survived','Sex']]
gender_survival_rate = pd.pivot_table(data,index='Sex', values='Survived', aggfunc=['sum','count'])
gender_survival_rate.columns = gender_survival_rate.columns.map(' '.join)
gender_survival_rate = gender_survival_rate.rename(columns={'sum Survived':'Sum Survived', 'count Survived':'Count Survived'})
gender_survival_rate['Survival Rate'] = gender_survival_rate['Sum Survived']/gender_survival_rate['Count Survived']
gender_survival_rate['Survival Rate'] = gender_survival_rate['Survival Rate'].map("{:.2%}".format)
gender_survival_rate

        Sum Survived  Count Survived Survival Rate
Sex
female           233             314        74.20%
male             109             577        18.89%

In [14]:
#of the survivors, how many were underage(18) including the split between gender and their corresponding survival rate
data = titanic[['Survived','Sex']]
data['Underage'] = titanic['Age'] < 18
data['Underage'].replace([True,False],[0,1])
underage_survival_rate = pd.pivot_table(data, index='Sex', values=['Survived', 'Underage'], aggfunc=['sum','count'])
underage_survival_rate.columns = underage_survival_rate.columns.map(' '.join)
underage_survival_rate['Ratio of Underage by Gender'] = underage_survival_rate['sum Underage']/underage_survival_rate['sum Survived']
underage_survival_rate['Ratio of Underage by Overall Survived'] = underage_survival_rate['sum Underage']/underage_survival_rate['count Survived']
underage_survival_rate['Ratio of Underage by Gender'] = underage_survival_rate['Ratio of Underage by Gender'].map("{:.2%}".format)
underage_survival_rate['Ratio of Underage by Overall Survived'] = underage_survival_rate['Ratio of Underage by Overall Survived'].map("{:.2%}".format)
underage_survival_rate = underage_survival_rate.drop(columns='count Underage')
underage_survival_rate

<ipython-input-14-6a5ca76b45d1>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['Underage'] = titanic['Age'] < 18

,sum Survived,sum Underage,count Survived,Ratio of Underage by Gender,Ratio of Underage by Overall Survived
Sex,,,,,
female,233,55,314,23.61%,17.52%
male,109,58,577,53.21%,10.05%